#pragma once

#include <stdbool.h>


/*
¬ычисл€ет формулу 
*/
void Ex_1();

/*
¬ычисл€ет скорость тела в момент времени t
*/
void Ex_2();

/*
–ешает квадратное уравнение
*/
void Ex_3();

/*
¬ычисл€ет стоимость разговора по номеру города и времени в секундах
@param c - код города, t - врем€ в секундах
@return стоимость разговора
*/
float Ex_4(int c, float t);

/*
¬ычисл€ет и выводит все четырехзначные числа јрмстронга
*/
void Ex_5();

/*
ѕереводит число из двоичной системы счислени€ в дес€тичную
*/
void Ex_6();

/*
‘ормирует массив L[i][j] с помощью датчика случайных чисел от -10 до 10, увеличивает каждый элемент массива в 3 раза и мен€ет знак на противоположный
*/
void Ex_7();